tap "valkyrie00/bbrew"
brew "atuin"
brew "bash-preexec"
brew "ca-certificates"
brew "bat"
brew "chezmoi"
brew "difftastic"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "gh"
brew "git-delta"
brew "gitu"
brew "hugo"
brew "jj"
brew "ksh93"
brew "mise"
brew "neovim"
brew "optipng"
brew "podman-tui"
brew "sqlite"
brew "ripgrep"
brew "rtk"
brew "rubyfmt"
brew "starship"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tealdeer"
brew "tig"
brew "topgrade"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "yazi"
brew "yq"
brew "zoxide"
brew "valkyrie00/bbrew/bbrew"
cask "font-0xproto-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
flatpak "com.dropbox.Client"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.google.Chrome"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.onepassword.OnePassword"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.rtosta.zapzap"
flatpak "com.spotify.Client"
flatpak "com.valvesoftware.Steam"
flatpak "eu.jumplink.Learn6502"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "it.mijorus.gearlever"
flatpak "md.obsidian.Obsidian"
flatpak "me.iepure.devtoolbox"
flatpak "net.waterfox.waterfox"
flatpak "org.deskflow.deskflow"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.fkoehler.KTailctl"
flatpak "org.gnome.DejaDup"
flatpak "org.jellyfin.JellyfinServer"
flatpak "org.kde.gwenview"
flatpak "org.kde.haruna"
flatpak "org.kde.kcalc"
flatpak "org.kde.kclock"
flatpak "org.kde.kweather"
flatpak "org.kde.okular"
flatpak "org.mozilla.Thunderbird"
flatpak "org.qbittorrent.qBittorrent"
flatpak "org.signal.Signal"
flatpak "org.telegram.desktop"
flatpak "us.zoom.Zoom"
