# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'bat' # better cat
brew 'exa' # better ls
brew 'fd'  # better find
brew 'fish'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'htop'
brew 'imagemagick'
brew 'jemalloc' # for Ruby
brew 'jq'
brew 'markdown'
brew 'nmap'
brew 'postgresql'
brew 'redis'
brew 'ripgrep'
brew 'sqlite'
brew 'starship'
brew 'telnet'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'

cask '1password'
cask 'alfred'
cask 'choosy'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'google-chrome'
cask 'iterm2'
cask 'sizeup'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
